# questions.py

from kbds.inline import get_multi_select_keyboard

questions = [ 
    "Какое настроение фильма сейчас хочется?",
    "Отметь жанры, которые любишь",
    "Какая эпоха фильмов интереснее?",
    "Какие истории цепляют больше всего?",
    "Фильмы каких стран ты предпочитаешь?"
]



QUESTION_KEYS = ["question_1", "question_2", "question_3", "question_4", "question_5"]

CALLBACK_IDS = {
    "question_1": {
        "funny": "😄 Весёлое",
        "romantic": "💖 Романтичное",
        "thrilling": "😰 Напряжённое / адреналин",
        "thoughtful": "🧠 Заставляющее задуматься",
        "touching": "🥹 Душевное / трогательное",
        "dark": "🌑 Мрачное",
        "uplifting": "🌈 Поднимающее настроение",
        "nostalgic": "📼 Ностальгическое"
    },
    "question_2": {
        "action": "🧨 Боевик",
        "comedy": "🎭 Комедия",
        "sci_fi": "👽 Научная фантастика",
        "fantasy": "🧝‍♀️ Фэнтези",
        "thriller": "🔍 Триллер / детектив",
        "horror": "😱 Ужасы",
        "drama": "🎬 Драма",
        "romcom": "💕 Романтическая комедия",
        "biography": "📚 Биография",
        "musical": "🎶 Мюзикл",
        "animation": "🐭 Анимация",
        "anime": "🌸 Аниме",
        "netflix": "📡 Netflix Originals",
        "dorama": "📺 Дорамы",
        "sports": "🏆 Спортивный",
        "doc": "🎥 Документальный",
        "cult": "⭐️ Культовое кино"
        
    },
    "question_3": {
        "modern": "🆕 Новинки (2019–сегодня)",
        "classic": "📀 Современная классика (2000–2018)",
        "retro": "📼 Ретро (до 2000)",
        "black_white": "⚫⚪ Чёрно-белое кино"
    },
    "question_4": {
        "superheroes": "🦸 Супергерои",
        "space": "🚀 Космос и будущее",
        "history": "🏰 Исторические драмы",
        "spy": "🕵️‍♂️ Шпионы и криминал",
        "real": "💡 Основано на реальных событиях",
        "love": "💔 Истории любви",
        "revenge": "😠 Месть",
        "friendship": "👫 Дружба",
        "coming_of_age": "🎓 Взросление",
        "social": "🌍 Социальные проблемы",
        "family": "👨‍👩‍👧‍👦 Семейные истории",
        "survival": "🌋 Борьба за выживание",
        "mystery": "🧩 Тайны и загадки"
    },
    "question_5": {
        "usa": "🇺🇸 США",
        "uk": "🇬🇧 Великобритания",
        "france": "🇫🇷 Франция",
        "italy": "🇮🇹 Италия",
        "germany": "🇩🇪 Германия",
        "russia": "🇷🇺 Россия",
        "japan": "🇯🇵 Япония",
        "korea": "🇰🇷 Южная Корея",
        "china": "🇨🇳 Китай",
        "india": "🇮🇳 Индия (Болливуд)",
        "spain": "🇪🇸 Испания",
        "scandinavia": "🇸🇪 Скандинавия (Швеция, Норвегия, Дания)",
        "iran": "🇮🇷 Иран",
        "mexico": "🇲🇽 Мексика",
        "australia": "🇦🇺 Австралия",
        "brazil": "🇧🇷 Бразилия",
        "world": "🌍 Другое / Не важно"

    }
}
